app/controllers/sessions_controller.rb

  def create
    user = find_user params[:email],params[:password]
    if user and user.valid_password?(params[:password])
      user.ensure_authentication_token!  # make sure the user has a token generated
      sign_in user if user
      render :template=>"sessions/create.json.jbuilder", :status=> :created, locals: {user: user,
        coming_quiz: Quiz.coming_quizzes.first} , :formats => [:json]
---
SELECT  `quizzes`.* FROM `quizzes`  ORDER BY time_to_be_published ASC LIMIT 1

  def destroy
    # expire auth token
    if student_signed_in?
      user = Student.where(:authentication_token => params[:auth_token]).first
    elsif instructor_signed_in?
      user = Instructor.where(:authentication_token => params[:auth_token]).first
    elsif admin_signed_in?
      user = Admin.where(:authentication_token => params[:auth_token]).first
---
SELECT  `students`.* FROM `students` WHERE `students`.`authentication_token` = 'j-qTL1TBCmAE_uzGDA_R'  ORDER BY `students`.`id` ASC LIMIT 1
SELECT  `instructors`.* FROM `instructors` WHERE `instructors`.`authentication_token` = 'bc5EzogVzxy5XWxAxdjg'  ORDER BY `instructors`.`id` ASC LIMIT 1
SELECT  `admins`.* FROM `admins` WHERE `admins`.`authentication_token` = '_GigE5wYcFzehEnrkpac'  ORDER BY `admins`.`id` ASC LIMIT 1

    def find_user (email,password)
      if student = Student.find_by_email(email) and student.valid_password?(password)
         user = Student.find_for_database_authentication(:email => email)
         @role = "student"
      elsif instructor = Instructor.find_by_email(email) and instructor.valid_password?(password)
         user = Instructor.find_for_database_authentication(:email => email)
         @role = "instructor"
      elsif admin = Admin.find_by_email(email) and admin.valid_password?(password)
---
SELECT  `students`.* FROM `students` WHERE `students`.`email` = ''  ORDER BY `students`.`id` ASC LIMIT 1
SELECT  `instructors`.* FROM `instructors` WHERE `instructors`.`email` = 'cherifsalama@gmail.com'  ORDER BY `instructors`.`id` ASC LIMIT 1
SELECT  `admins`.* FROM `admins` WHERE `admins`.`email` = 'admin12@gmail.com'  ORDER BY `admins`.`id` ASC LIMIT 1