app/controllers/sessions_controller.rb

UPDATE `students` SET `last_sign_in_at` = '2015-02-07 00:17:45.000000', `current_sign_in_at` = '2015-02-07 00:19:34.603202', `last_sign_in_ip` = '192.168.1.4', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 23, `updated_at` = '2015-02-07 00:19:34.605360' WHERE `students`.`id` = 1
---
  def destroy
    # expire auth token
    student = Student.where(:authentication_token => params[:authentication_token]).first
    student.reset_authentication_token!
    student.update(authentication_token: nil)