app/controllers/student_mcqs_controller.rb

  def index
    @student_mcqs = StudentMcq.all
---
SELECT `student_mcqs`.* FROM `student_mcqs`