app/controllers/students_controller.rb

  def index
    # @students = Student.all
        #password = "passIns1"
  #email = "cherifSalama@gmail.com"
  #logindata=params
  email = params[:gg]
  password = params[:hh]


    #email = logindata[:email]
    #password= logindata[:password]
    #puts logindata
    # JSON to get name and password
   #puts "heyyyyyyy!! #{params} bsssssss"

  if student1 = Student.find_by_email(email) and student1.password == password

      @display =  " student login "

  elsif instructor1 = Instructor.find_by_email(email)  #and instructor1.password == password
---
SELECT  `students`.* FROM `students` WHERE `students`.`email` = 'cherifSalama@gmail.com' LIMIT 1
SELECT  `instructors`.* FROM `instructors` WHERE `instructors`.`email` = 'cherifSalama@gmail.com' LIMIT 1

    def set_student
      @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 5  ORDER BY `students`.`id` ASC LIMIT 1