app/controllers/users_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`email` = 'cherifSalama@gmail.com' LIMIT 1
SELECT  `instructors`.* FROM `instructors` WHERE `instructors`.`email` = 'cherifSalama@gmail.com' LIMIT 1
---
	def login

		email = params[:email]
		password = params[:password]

		if student1 = Student.find_by_email(email) and student1.password == password

			@student1 = student1


		respond_to do |format|
			format.json
		end

		elsif instructor1 = Instructor.find_by_email(email) and instructor1.password == password